{
  "description": "Overview<br><br><p style=\"margin: 0px;\">Provides patient care by collecting and processing samples and performing clinical laboratory procedures. Work at other Mercy facilities performing the same functions, as required. Perform other duties and projects as assigned.</p><ul><li>MLS/MLT</li><li>Harvard Hospital and Medical Center, Harvard IL</li><li>40 Hours/2 Weeks</li><li>Day Shift</li><li><strong>$10,000 Sign On Bonus</strong></li></ul><p style=\"margin: 0px;\"><strong>Authorization to work in the United States without sponsorship.</strong></p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin-bottom: 6.0pt;\">Experience a rewarding and fulfilling career with Mercyhealth. Mercyhealth is committed to offering our partners a best place to work. Our unique workplace Culture of Excellence is built upon:</p><ul><li style=\"margin: 0in 0in 6.0pt .75in;\">Employee engagement, empowerment and growth</li><li style=\"margin: 0in 0in 6.0pt .75in;\">Teamwork toward our common goal &ndash; providing exceptional health care services with a passion for making lives better</li><li style=\"margin: 0in 0in 6.0pt .75in;\">An atmosphere of caring and quality that cascades throughout the organizationd.</li></ul><p style=\"margin: 0px;\"><iframe src=\"//www.youtube.com/embed/mS6d5EhuDfw\" width=\"560\" height=\"314\" allowfullscreen=\"allowfullscreen\"></iframe></p> <br>Responsibilities<br><br><p style=\"margin: 0px;\"><strong>Essential Duties and Responsibilities</strong></p><ul><li>Utilize the Information System to receive patients, order and collect samples, result tests, answer questions from nurses and physicians, document quality control activities and produce reports required to perform job tasks.</li><li>Confirms accuracy of patient sample identification prior to performing analyses; evaluates specimen quality and identifies when unacceptable. Documents information concerning quality of specimen, impact of sub-optimal specimens on test values. Initiates recollection procedure as indicated.</li><li>Perform waived, moderate and high complexity lab tests as defined by CLIA in the lab specialties of hematology, urinalysis, chemistry and blood bank or microbiology by automated and manual methods according to defined policies and procedures.</li><li>Analyze test results prior to release of information to chart for validity and accuracy. Recognizes subtle yet significant problems which occur with testing methodologies. Troubleshoots suspect test results using technical knowledge and experience. Implements corrective action when inaccurate, inappropriate findings/results/reports are identified.</li><li>Performs high complexity tests such as bone marrow, sperm morphology, etc.</li><li>Assure that designated turnaround times for results are met and that critical results are appropriately reported and documented.</li><li>Perform quality control and proficiency testing procedures as defined by policy.</li><li>Interpret and troubleshoot quality control results to ensure accurate and precise test results.</li><li>Perform preventative maintenance, advanced troubleshooting and calibration of laboratory instrumentation.</li><li>Participate in method and instrument evaluation and implementation.</li><li>Investigates/resolves technical issues.</li><li>Participates on interdepartmental committees or teams.</li><li>Participates in teaching students and training new partners.</li><li>Completes and signs off on competency checklists for techs.</li><li>Develops updates and procedures as requested.</li><li>Serves as a resource to inexperienced partners.</li><li>Performs additional tasks such as scheduling, antibiograms, etc.</li><li>Maintain competency in current procedures and gain competency for new methods implemented.</li></ul><p style=\"margin: 0px;\">&nbsp;</p> <br>Education and Experience<br><br><p style=\"margin: 0px;\">1.Bachelor of Science degree in Medical Technology<br />Must be qualified to perform high complexity testing according to CLIA 493.1489 Standard; Testing personnel qualifications.<br /><br />OR<br /><br />2.Associates degree in Medical Technology AND MLT certification<br />Must be qualified to perform high complexity testing according to CLIA 493.1489 Standard; Testing personnel qualifications.</p> <br>Certification/Licensure<br><br><p style=\"margin: 0px;\">1. MT/MLS Generalist Certification or Specialty Certification BB, C, H or M required within 12 months of hire.</p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\">OR</p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\">2. MLT Certification and 5 years of experience.</p> <br>Special Physical Demands<br><br><p style=\"margin: 0px;\">The Special Physical Demands are considered Essential Job Function of the position with or without accommodations.</p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\">While performing the duties of this Job, the employee is frequently required to stand; use hands to finger, handle, or feel. The employee is required to talk, hear and smell. The employee is occasionally required to walk; sit and reach with hands and arms. The employee may have occasion to reach overhead to pick up objects or to adjust items. The employee may have occasion to bend under or crawl under bench to move or obtain objects. The employee must occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, color vision, depth perception and ability to adjust focus</p> <br>Culture of Excellence Behavior Expectations<br><br><p style=\"margin: 0px;\">To perform the job successfully, an individual should demonstrate the following behavior expectations:<br /><br /><u>Quality</u> - Follows policies and procedures; adapts to and manages changes in the environment; Demonstrates accuracy and thoroughness giving attention to details; Looks for ways to improve and promote quality; Applies feedback to improve performance; Manages time and prioritizes effectively to achieve organizational goals.<br /><br /><u>Service</u> - Responds promptly to requests for service and assistance; Follows the Mercyhealth Critical Moments of service; Meets commitments; Abides by MH confidentiality and security agreement; Shows respect and sensitivity for cultural differences; and effectively communicates information to partners; Thinks system wide regarding processes and functions.<br /><br /><u>Partnering</u> - Shows commitment to the Mission of Mercyhealth and Culture of Excellence through all words and actions; Exhibits objectivity and openness to other's views; Demonstrates a high level of participation and engagement in day-to-day work; Gives and welcomes feedback; Generates suggestions for improving work: Embraces teamwork, supports and encourages positive change while giving value to individuals.<br /><br /><u>Cost</u> - Conserves organization resources; Understands fiscal responsibility; Works within approved budget; Develops and implements cost saving measures; contributes to profits and revenue.</p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\">#MHLAB123</p><p style=\"margin: 0px;\">&nbsp;</p><p style=\"margin: 0px;\"><iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/t599IHFQh7s \" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p> <br>Benefits<br><br><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\"><span style=\"font-weight: bold;\">Mercyhealth offers a generous total rewards package to eligible employees including, but not limited to:</span>&nbsp;</p><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\">&middot; <span style=\"font-weight: bold;\">Comprehensive Benefits Package:</span> Mercyhealth offers a retirement plan with competitive matching contribution, comprehensive medical, dental, and vision insurance options, life and disability coverage, access to flexible spending plans, and a variety of other discounted voluntary benefit options.</p><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\">&middot; <span style=\"font-weight: bold;\">Competitive Compensation:</span> Mercyhealth offers market competitive rates of pay and participates in various shift differential and special pay incentive programs.</p><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\">&middot; <span style=\"font-weight: bold;\">Paid Time Off:</span> Mercyhealth offers a generous paid time off plan, which increases with milestone anniversaries, to allow employees the opportunity for a great work-life balance.</p><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\">&middot; <span style=\"font-weight: bold;\">Career Advancement:</span> Mercyhealth offers a number of educational assistance programs and career ladders to support employees in their educational journey and advancement within Mercyhealth.</p><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\">&middot; <span style=\"font-weight: bold;\">Employee Wellbeing:</span> Mercyhealth has a focus on wellbeing for employees across the organization and offers a number of tools and resources, such as an employer-sponsored health risk assessment and a Wellbeing mobile application, to assist employees on their wellbeing journey.</p><p style=\"margin: 0in; font-family: Verdana; font-size: 9.0pt;\">&middot; <span style=\"font-weight: bold;\">Additional Benefits:</span> Mercyhealth employees have access to our internal and external employee assistance programs, employee-only discount packages, paid parental and caregiver leaves, on-demand pay, special payment programs for patient services, and financial education to help with retirement planning.</p>",
  "responsibilities": [
    "Utilize the Information System to receive patients, order and collect samples, result tests, answer questions from nurses and physicians, document quality control activities and produce reports required to perform job tasks.",
    "Confirms accuracy of patient sample identification prior to performing analyses; evaluates specimen quality and identifies when unacceptable. Documents information concerning quality of specimen, impact of sub-optimal specimens on test values. Initiates recollection procedure as indicated.",
    "Perform waived, moderate and high complexity lab tests as defined by CLIA in the lab specialties of hematology, urinalysis, chemistry and blood bank or microbiology by automated and manual methods according to defined policies and procedures.",
    "Analyze test results prior to release of information to chart for validity and accuracy. Recognizes subtle yet significant problems which occur with testing methodologies. Troubleshoots suspect test results using technical knowledge and experience. Implements corrective action when inaccurate, inappropriate findings/results/reports are identified.",
    "Performs high complexity tests such as bone marrow, sperm morphology, etc.",
    "Assure that designated turnaround times for results are met and that critical results are appropriately reported and documented.",
    "Perform quality control and proficiency testing procedures as defined by policy.",
    "Interpret and troubleshoot quality control results to ensure accurate and precise test results.",
    "Perform preventative maintenance, advanced troubleshooting and calibration of laboratory instrumentation.",
    "Participate in method and instrument evaluation and implementation.",
    "Investigates/resolves technical issues.",
    "Participates on interdepartmental committees or teams.",
    "Participates in teaching students and training new partners.",
    "Completes and signs off on competency checklists for techs.",
    "Develops updates and procedures as requested.",
    "Serves as a resource to inexperienced partners.",
    "Performs additional tasks such as scheduling, antibiograms, etc.",
    "Maintain competency in current procedures and gain competency for new methods implemented."
  ],
  "qualifications": [
    "1.Bachelor of Science degree in Medical TechnologyMust be qualified to perform high complexity testing according to CLIA 493.1489 Standard; Testing personnel qualifications.",
    "2.Associates degree in Medical Technology",
    "MLT certificationMust be qualified to perform high complexity testing according to CLIA 493.1489 Standard; Testing personnel qualifications.",
    "1. MT/MLS Generalist Certification or Specialty Certification BB, C, H or M required within 12 months of hire.&nbsp;",
    "&nbsp;2. MLT Certification and 5 years of experience."
  ]
}