{
    "url": "https://careers.mercyhealthsystem.org/jobs/37949?lang=en-us",
    "title": "Patient Access Supervisor",
    "company": "Mercyhealth",
    "department": "Administrative / Clerical",
    "location": {
        "city": "Crystal Lake",
        "state": "Illinois",
        "hospital": "Crystal Lake Hospital",
        "address": "875 S Route 31, Crystal Lake, IL 60014"
    },
    "employmentType": "Active Full-Time Salary",
    "jobId": "37949",
    "salary": {
        "annual": {
            "min": 48526.40,
            "max": 77642.24,
            "currency": "USD",
            "formatted": "$48,526.40/Yr - $77,642.24/Yr"
        },
        "hourly": {
            "min": 24.26,
            "max": 38.82,
            "currency": "USD",
            "formatted": "$24.26/hr - $38.82/hr",
            "hoursPerYear": 2000
        }
    },
    "description": "The Patient Access Supervisor is responsible for the coordination and supervision of partners within the Office of Patient Access Management and other designated areas within Revenue Cycle. Assigned Departments include all access areas (hospital registration, patient financial counselors, registration specialists, precertification, referral specialists, scheduling etc.) This position will also provide dotted line oversight to other front end operations such as reception and patient service representative in conjunction with clinic and hospital leadership.",
    "responsibilities": [
        "In-depth knowledge of all applications used in Patient Access and Revenue Cycle operations (e.g. EPIC, RTE, Scheduling, etc.). Responsible for ensuring staffing needs are met while maintaining budgeted staffing levels. Implement alternative staffing patterns as needs arise.",
        "Review and process time cards in an accurate and timely manner. Maintain accurate employee attendance files.",
        "Interviews and hires applicants to maintain adequate staffing levels.",
        "Provides orientation and training to new hires, completing necessary competency/orientation checklists. Actively seek and schedule staff development opportunities, including those outside the department that would be beneficial for partners to attend.",
        "Performs audits to review partner performance on an ongoing basis to ensure policies and procedures are being followed consistently and that any issues are addressed. Provide timely performance improvement feedback and coaching.",
        "Evaluates partners by conducting training assessment and completing employee performance reviews on time.",
        "Monitors and maintains reports and dashboards to monitor productivity on each partner and the Department as a whole.",
        "Monitor the accuracy of the data entry of demographic and insurance information and adherence to access and financial policies/procedures.",
        "Develop, recommend and implement policies and procedures for the department.",
        "Enforces established policies and procedures, including work rules, safety procedures, confidentiality standards, CMOS, JCAHO standards and CMS standards.",
        "Monitors work queues and reports to ensure accurate and timely registration, scheduling and claims submission",
        "Coordinates functions within defined work group, works cooperatively with other work group supervisors to ensure smooth and timely processing of third party claims.",
        "Maintains a solid understanding and knowledge of payer requirements, registration and scheduling workflows, as well as referral requirements.",
        "Responsible for reviewing and analyzing new government billing regulations/guidelines, new managed care contracts, and industry publications.",
        "Ensures that the department follows and adheres to all policies and guidelines regarding the handling of cash and checks.",
        "Monitors and reviews precertification and referral authorizations workflows to ensure maximum reimbursement for services.",
        "Work collaboratively with counterparts, Patient Financial Services, and other departments on issues relating to patient registration, scheduling, patient flow, insurance verification, referrals and reimbursement issues.",
        "Serve as the knowledge expert and information source for staff. Keep abreast of insurance, referral, and billing requirements",
        "Provides Ancillary Providers with necessary and accurate information related to insurance determination and financial compliance.",
        "Assist with application implementation, upgrades, enhancements, and usability testing.",
        "Provides education and training to clinic leadership and partners to ensure financial policies are being adhered to.",
        "Reviews registration or authorization related denials and provides education as necessary to reduce write offs.",
        "Performs other duties as assigned."
    ],
    "cultureOfExcellence": {
        "quality": [
            "Follows policies and procedures",
            "Adapts to and manages changes in the environment",
            "Demonstrates accuracy and thoroughness giving attention to details",
            "Looks for ways to improve and promote quality",
            "Applies feedback to improve performance",
            "Manages time and prioritizes effectively to achieve organizational goals"
        ],
        "service": [
            "Responds promptly to requests for service and assistance",
            "Follows the Mercyhealth Critical Moments of service",
            "Meets commitments",
            "Abides by MH confidentiality and security agreement",
            "Shows respect and sensitivity for cultural differences",
            "Effectively communicates information to partners",
            "Thinks system wide regarding processes and functions"
        ],
        "partnering": [
            "Shows commitment to the Mission of Mercyhealth and Culture of Excellence through all words and actions",
            "Exhibits objectivity and openness to other's views",
            "Demonstrates a high level of participation and engagement in day-to-day work",
            "Gives and welcomes feedback",
            "Generates suggestions for improving work",
            "Embraces teamwork, supports and encourages positive change while giving value to individuals"
        ],
        "cost": [
            "Conserves organization resources",
            "Understands fiscal responsibility",
            "Works within approved budget",
            "Develops and implements cost saving measures",
            "Contributes to profits and revenue"
        ]
    },
    "educationAndExperience": {
        "requirements": [
            "High school diploma or equivalent required",
            "Associates degree in a business or healthcare field required (or an equivalent of experience, certification and years of service)",
            "Four years of patient access, revenue cycle or other healthcare experience required, with emphasis in access services, POS collections, registration, scheduling, insurance verifications/authorization, billing, or customer service",
            "Two years of prior supervisory related experience required"
        ]
    },
    "certificationAndLicensure": {
        "requirements": [
            "Certification related to health care revenue cycle (EPIC, AAHAM, NAHAM, HMFA, etc.) or an equivalently designated certification approved by management within 1 year of hire"
        ]
    },
    "skillsAndAbilities": {
        "requirements": [
            "Proven ability to work effectively in a team environment",
            "Strong typing/data entry experience",
            "Strong organizational skills and attention to detail, accuracy and follow-through",
            "Knowledge of medical terminology preferred"
        ]
    },
    "physicalDemands": {
        "requirements": [
            "Regularly required to use hands to finger, handle, or feel",
            "Regularly required to reach with hands and arms and talk or hear",
            "Frequently required to sit",
            "Occasionally required to stand, walk, climb, or balance and stoop, kneel, crouch, or crawl",
            "Must occasionally lift and/or move up to 25 pounds",
            "Specific vision abilities required: close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus"
        ]
    },
    "supervision": {
        "level": "LEVEL OF SUPERVISION",
        "responsibilities": [
            "Interviewing, hiring, and training employees",
            "Planning, assigning, and directing work",
            "Appraising performance",
            "Rewarding and disciplining employees",
            "Addressing complaints and resolving problems",
            "Employee adherence to annual education and certification requirements"
        ]
    },
    "benefits": {
        "comprehensiveBenefits": [
            "Retirement plan with competitive matching contribution",
            "Comprehensive medical, dental, and vision insurance options",
            "Life and disability coverage",
            "Access to flexible spending plans",
            "Variety of other discounted voluntary benefit options"
        ],
        "compensation": [
            "Market competitive rates of pay",
            "Various shift differential and special pay incentive programs"
        ],
        "timeOff": [
            "Generous paid time off plan",
            "Increases with milestone anniversaries"
        ],
        "careerAdvancement": [
            "Educational assistance programs",
            "Career ladders to support advancement"
        ],
        "employeeWellbeing": [
            "Employer-sponsored health risk assessment",
            "Wellbeing mobile application"
        ],
        "additionalBenefits": [
            "Internal and external employee assistance programs",
            "Employee-only discount packages",
            "Paid parental and caregiver leaves",
            "On-demand pay",
            "Special payment programs for patient services",
            "Financial education for retirement planning"
        ]
    },
    "htmlPath": "job-postings/mercy-health-37949/careers.mercyhealthsystem.org-jobs-37949-2025-04-24.html",
    "screenshotPath": "job-postings/mercy-health-37949/careers.mercyhealthsystem.org-jobs-37949-2025-04-24.png",
    "metadata": {
        "created": "2025-04-25T03:41:08.209Z",
        "lastModified": "2025-04-25T03:41:08.209Z",
        "source": "Mercyhealth Careers Website",
        "version": "1.0"
    }
}