{
  "url": "https://careers.mercyhealthsystem.org/jobs/37949?lang=en-us",
  "title": "Patient Access Supervisor in Crystal Lake, Illinois | Mercyhealth",
  "company": "Patient Access Supervisor in Crystal Lake, Illinois | Mercyhealth",
  "description": "OverviewThe Patient Access Supervisor is responsible for the coordination and supervision of partners within the Office of Patient Access Management and other designated areas within Revenue Cycle. Assigned Departments include all access areas (hospital registration, patient financial counselors, registration specialists, precertification, referral specialists, scheduling etc.) This position will also provide dotted line oversight to other front end operations such as reception and patient service representative in conjunction with clinic and hospital leadership. This position requires a detailed knowledge base in registration, emergency department, clinic and hospital access, insurance authorization and benefit determinations, scheduling protocols and billing practices, as well as an understanding of how these areas impact the flow of work throughout various departments and the organization. The Supervisor is responsible for developing and enforcing policies and procedures, monitoring the accuracy of registration, scheduling, and adherence to financial and access protocols. In addition, this positons is responsible for ensuring patient experience protocols are followed, monitoring in basket pools, and clearing issues in various registration, access, and billing work queues, and managing the overall training and coordination of work for the department. Included in the supervision of these areas is preparation of staffing schedules and recommendation and coordination of program-related improvements and changes. Included in the supervision of these areas is preparation of staffing schedules and recommendation and coordination of program-related improvements and changes. The position requires the ability to independently plan, schedule, organize and respond appropriately on a wide variety of subjects and situations. The ability to perform the duties of the staff supervised is required. As hospital reimbursement, patient experience, and provider schedules are dependent upon the activities of the Patient Access Department, timely completion of duties and follow-up is critical. Involvement in departmental and interdepartmental process improvement teams would also be expected of the individual ResponsibilitiesEssential Duties and ResponsibilitiesIn-depth knowledge of all applications used in Patient Access and Revenue Cycle operations (e.g. EPIC, RTE, Scheduling, etc.). Responsible for ensuring staffing needs are met while maintaining budgeted staffing levels. Implement alternative staffing patterns as needs arise. Review and process time cards in an accurate and timely manner. Maintain accurate employee attendance files.Interviews and hires applicants to maintain adequate staffing levels.Provides orientation and training to new hires, completing necessary competency/orientation checklists. Actively seek and schedule staff development opportunities, including those outside the department that would be beneficial for partners to attend Supervises partners and ensures workload is distributed equitably within the work group. Conduct team meetings to apprise staff of changes and to address broader-based program area issues and initiatives. Assist staff with complex work situations. Performs audits to review partner performance on an ongoing basis to ensure policies and procedures are being followed consistently and that any issues are addressed. Provide timely performance improvement feedback and coaching. Evaluates partners by conducting training assessment and completing employee performance reviews on time.Monitors and maintains reports and dashboards to monitor productivity on each partner and the Department as a whole. Tracks and measures volume of work assigned to the work group to set goals and monitor trends and shifts in volume, etc. Monitor the accuracy of the data entry of demographic and insurance information and adherence to access and financial policies/procedures. Develop, recommend and implement policies and procedures for the department. Update policy and procedure resources as necessary and ensure partners are notified of changes. Enforces established policies and procedures, including work rules, safety procedures, confidentiality standards, CMOS, JCAHO standards and CMS standards. Monitors accuracy of scheduling functions, provider templates and makes recommendations on template changes to best utilize providers time, while ensuring patient satisfaction.Monitors work queues and reports to ensure accurate and timely registration, scheduling and claims submissionCoordinates functions within defined work group, works cooperatively with other work group supervisors to ensure smooth and timely processing of third party claims and timely follow-up with patients.Maintains a solid understanding and knowledge of payer requirements, registration and scheduling workflows, as well as referral requirements to ensure staff follows established procedures to maximize reimbursement.Responsible for reviewing and analyzing new government billing regulations/guidelines, new managed care contracts, and industry publications to advise Director, partners, and other department heads of potential issues that could impact billing, reimbursement and compliance.Ensures that the department follows and adheres to all policies and guidelines regarding the handling of cash and checks, and the posting of payments and adjustments according to Finance.Monitors and reviews precertification and referral authorizations workflows to ensure maximum reimbursement for services. Work collaboratively with counterparts, Patient Financial Services, and other departments on issues relating to patient registration, scheduling, patient flow, insurance verification, referrals and reimbursement issues.Serve as the knowledge expert and information source for staff. Keep abreast of insurance, referral, and billing requirementsProvides Ancillary Providers with necessary and accurate information related to insurance determination and financial compliance. Assist with application implementation, upgrades, enhancements, and usability testing. .Provides education and training to clinic leadership and partners to ensure financial policies are being adhered to.Reviews registration or authorization related denials and provides education as necessary to reduce write offs. Performs other duties as assigned.Culture of Excellence Behavior ExpectationsTo perform the job successfully, an individual should demonstrate the following behavior expectations: Quality - Follows policies and procedures; adapts to and manages changes in the environment; Demonstrates accuracy and thoroughness giving attention to details; Looks for ways to improve and promote quality; Applies feedback to improve performance; Manages time and prioritizes effectively to achieve organizational goals. Service - Responds promptly to requests for service and assistance; Follows the Mercyhealth Critical Moments of service; Meets commitments; Abides by MH confidentiality and security agreement; Shows respect and sensitivity for cultural differences; and effectively communicates information to partners; Thinks system wide regarding processes and functions. Partnering - Shows commitment to the Mission of Mercyhealth and Culture of Excellence through all words and actions; Exhibits objectivity and openness to other's views; Demonstrates a high level of participation and engagement in day-to-day work; Gives and welcomes feedback; Generates suggestions for improving work: Embraces teamwork, supports and encourages positive change while giving value to individuals. Cost - Conserves organization resources; Understands fiscal responsibility; Works within approved budget; Develops and implements cost saving measures; contributes to profits and revenue.Education and ExperienceHigh school diploma or equivalent required. Associates degree in a business or healthcare field required (or an equivalent of experience, certification and years of service) . Four years of patient access, revenue cycle or other healthcare experience required, with emphasis in access services, POS collections, registration, scheduling, insurance verifications/authorization, billing, or customer service. Two years of prior supervisory related experience required. Certification and LicensureCertification related to health care revenue cycle (EPIC, AAHAM, NAHAM, HMFA, etc.) or an equivalently designated certification approved by management within 1 year of hire.Skills and AbilitiesProven ability to work effectively in a team environment. Strong typing/data entry experience. Strong organizational skills and attention to detail, accuracy and follow-through. Knowledge of medical terminology preferred.Special Physical DemandsThe Special Physical Demands are considered Essential Job Functions of the position with or without reasonable accommodations.While performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel; reach with hands and arms and talk or hear. The employee is frequently required to sit. The employee is occasionally required to stand; walk; climb; or balance and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus. Level of SupervisionLEVEL OF SUPERVISION Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems; employee adherence to annual education and certification requirementsSupervisesSupervisory responsibilities are conducted in accordance with directives of management, the organization's policies, and applicable laws. BenefitsMercyhealth offers a generous total rewards package to eligible employees including, but not limited to: · Comprehensive Benefits Package: Mercyhealth offers a retirement plan with competitive matching contribution, comprehensive medical, dental, and vision insurance options, life and disability coverage, access to flexible spending plans, and a variety of other discounted voluntary benefit options.· Competitive Compensation: Mercyhealth offers market competitive rates of pay and participates in various shift differential and special pay incentive programs.· Paid Time Off: Mercyhealth offers a generous paid time off plan, which increases with milestone anniversaries, to allow employees the opportunity for a great work-life balance.· Career Advancement: Mercyhealth offers a number of educational assistance programs and career ladders to support employees in their educational journey and advancement within Mercyhealth.· Employee Wellbeing: Mercyhealth has a focus on wellbeing for employees across the organization and offers a number of tools and resources, such as an employer-sponsored health risk assessment and a Wellbeing mobile application, to assist employees on their wellbeing journey.· Additional Benefits: Mercyhealth employees have access to our internal and external employee assistance programs, employee-only discount packages, paid parental and caregiver leaves, on-demand pay, special payment programs for patient services, and financial education to help with retirement planning.",
  "responsibilities": [
    "In-depth knowledge of all applications used in Patient Access and Revenue Cycle operations (e.g. EPIC, RTE, Scheduling, etc.). Responsible for ensuring staffing needs are met while maintaining budgeted staffing levels. Implement alternative staffing patterns as needs arise.",
    "Review and process time cards in an accurate and timely manner. Maintain accurate employee attendance files.",
    "Interviews and hires applicants to maintain adequate staffing levels.",
    "Provides orientation and training to new hires, completing necessary competency/orientation checklists. Actively seek and schedule staff development opportunities, including those outside the department that would be beneficial for partners to attend Supervises partners and ensures workload is distributed equitably within the work group. Conduct team meetings to apprise staff of changes and to address broader-based program area issues and initiatives. Assist staff with complex work situations.",
    "Performs audits to review partner performance on an ongoing basis to ensure policies and procedures are being followed consistently and that any issues are addressed. Provide timely performance improvement feedback and coaching.",
    "Evaluates partners by conducting training assessment and completing employee performance reviews on time.",
    "Monitors and maintains reports and dashboards to monitor productivity on each partner and the Department as a whole. Tracks and measures volume of work assigned to the work group to set goals and monitor trends and shifts in volume, etc.",
    "Monitor the accuracy of the data entry of demographic and insurance information and adherence to access and financial policies/procedures.",
    "Develop, recommend and implement policies and procedures for the department. Update policy and procedure resources as necessary and ensure partners are notified of changes.",
    "Enforces established policies and procedures, including work rules, safety procedures, confidentiality standards, CMOS, JCAHO standards and CMS standards. Monitors accuracy of scheduling functions, provider templates and makes recommendations on template changes to best utilize providers time, while ensuring patient satisfaction.",
    "Monitors work queues and reports to ensure accurate and timely registration, scheduling and claims submission",
    "Coordinates functions within defined work group, works cooperatively with other work group supervisors to ensure smooth and timely processing of third party claims and timely follow-up with patients.",
    "Maintains a solid understanding and knowledge of payer requirements, registration and scheduling workflows, as well as referral requirements to ensure staff follows established procedures to maximize reimbursement.",
    "Responsible for reviewing and analyzing new government billing regulations/guidelines, new managed care contracts, and industry publications to advise Director, partners, and other department heads of potential issues that could impact billing, reimbursement and compliance.",
    "Ensures that the department follows and adheres to all policies and guidelines regarding the handling of cash and checks, and the posting of payments and adjustments according to Finance.",
    "Monitors and reviews precertification and referral authorizations workflows to ensure maximum reimbursement for services.",
    "Work collaboratively with counterparts, Patient Financial Services, and other departments on issues relating to patient registration, scheduling, patient flow, insurance verification, referrals and reimbursement issues.",
    "Serve as the knowledge expert and information source for staff. Keep abreast of insurance, referral, and billing requirements",
    "Provides Ancillary Providers with necessary and accurate information related to insurance determination and financial compliance.",
    "Assist with application implementation, upgrades, enhancements, and usability testing. .",
    "Provides education and training to clinic leadership and partners to ensure financial policies are being adhered to.",
    "Reviews registration or authorization related denials and provides education as necessary to reduce write offs.",
    "Performs other duties as assigned."
  ],
  "qualifications": [],
  "htmlPath": "job-postings/mercy-health-37949/careers.mercyhealthsystem.org-jobs-37949-2025-04-24.html",
  "screenshotPath": "job-postings/mercy-health-37949/careers.mercyhealthsystem.org-jobs-37949-2025-04-24.png"
}