{
  "url": "https://careers.mercyhealthsystem.org/jobs/37949?lang=en-us",
  "title": "Patient Access Supervisor in Crystal Lake, Illinois | Mercyhealth",
  "company": "Mercyhealth",
  "location": "Crystal Lake, Illinois",
  "application_status": "Ready for submission",
  "job_type": "Full-time",
  "position": "Patient Access Supervisor",
  "application_materials": {
    "detailed_cv": "./cv-draft.md (lines 1-227)",
    "concise_cv": "./cv-draft.md (lines 228-end)",
    "documentation": "./README.md"
  },
  "application_summary": {
    "key_qualifications_addressed": [
      "Healthcare administration experience",
      "Patient access management",
      "Revenue cycle operations",
      "Supervisory capabilities",
      "EPIC systems experience",
      "Technical proficiencies",
      "Regulatory compliance knowledge",
      "Education requirement (through experience equivalent)"
    ],
    "highlighted_experiences": [
      "Fox Lake Animal Hospital - Patient flow management",
      "Midwest Sports Medicine - Front desk and call center supervision",
      "Family Medicine Practice - Patient scheduling and records management",
      "Northwest Oncology - Medical records and patient coordination",
      "Team leadership experience from real estate roles"
    ]
  },
  "notes": "Application package complete and ready for submission. Both detailed and concise versions of CV available for different application contexts."
}

{
  "title": "Patient Access Supervisor",
  "company": "Mercyhealth",
  "location": "Crystal Lake, Illinois",
  "education": [
    "High school diploma or equivalent",
    "Associates degree in a business or healthcare field (or an equivalent of experience, certification and years of service)"
  ],
  "experience": [
    "Over 40 years of experience in customer service and healthcare",
    "Multiple roles in healthcare front desk and patient management",
    "Supervisory experience in healthcare settings"
  ],
  "certifications": [
    "Certified Pharmacy Technician (CPhT, Illinois State License, 1996)"
  ],
  "skills": [
    "Patient Intake & Triage (Human/Animal)",
    "Scheduling",
    "Scribing",
    "Charting & Records Management",
    "HIPAA Compliance",
    "Insurance Verification/Reconciliation",
    "Medical Equipment Prep/Sterilization",
    "Pharmacy Support",
    "Team Leadership & Supervision (up to 9 agents)",
    "Training & Onboarding",
    "Realtor Board Service & Committee Leadership",
    "Training Program Development",
    "Supervision (Healthcare Front Desk/Call Center)",
    "Process Improvement",
    "Policy Development",
    "Patient Access Management",
    "Insurance Authorization",
    "Billing Practices"
  ],
  "responsibilities": [
    "In-depth knowledge of all applications used in Patient Access and Revenue Cycle operations (e.g. EPIC, RTE, Scheduling, etc.). Responsible for ensuring staffing needs are met while maintaining budgeted staffing levels. Implement alternative staffing patterns as needs arise.",
    "Review and process time cards in an accurate and timely manner. Maintain accurate employee attendance files.",
    "Interviews and hires applicants to maintain adequate staffing levels.",
    "Provides orientation and training to new hires, completing necessary competency/orientation checklists. Actively seek and schedule staff development opportunities, including those outside the department that would be beneficial for partners to attend Supervises partners and ensures workload is distributed equitably within the work group. Conduct team meetings to apprise staff of changes and to address broader-based program area issues and initiatives. Assist staff with complex work situations.",
    "Performs audits to review partner performance on an ongoing basis to ensure policies and procedures are being followed consistently and that any issues are addressed. Provide timely performance improvement feedback and coaching.",
    "Evaluates partners by conducting training assessment and completing employee performance reviews on time.",
    "Monitors and maintains reports and dashboards to monitor productivity on each partner and the Department as a whole. Tracks and measures volume of work assigned to the work group to set goals and monitor trends and shifts in volume, etc.",
    "Monitor the accuracy of the data entry of demographic and insurance information and adherence to access and financial policies/procedures.",
    "Develop, recommend and implement policies and procedures for the department. Update policy and procedure resources as necessary and ensure partners are notified of changes.",
    "Enforces established policies and procedures, including work rules, safety procedures, confidentiality standards, CMOS, JCAHO standards and CMS standards. Monitors accuracy of scheduling functions, provider templates and makes recommendations on template changes to best utilize providers time, while ensuring patient satisfaction.",
    "Monitors work queues and reports to ensure accurate and timely registration, scheduling and claims submission",
    "Coordinates functions within defined work group, works cooperatively with other work group supervisors to ensure smooth and timely processing of third party claims and timely follow-up with patients.",
    "Maintains a solid understanding and knowledge of payer requirements, registration and scheduling workflows, as well as referral requirements to ensure staff follows established procedures to maximize reimbursement.",
    "Responsible for reviewing and analyzing new government billing regulations/guidelines, new managed care contracts, and industry publications to advise Director, partners, and other department heads of potential issues that could impact billing, reimbursement and compliance.",
    "Ensures that the department follows and adheres to all policies and guidelines regarding the handling of cash and checks, and the posting of payments and adjustments according to Finance.",
    "Monitors and reviews precertification and referral authorizations workflows to ensure maximum reimbursement for services.",
    "Work collaboratively with counterparts, Patient Financial Services, and other departments on issues relating to patient registration, scheduling, patient flow, insurance verification, referrals and reimbursement issues.",
    "Serve as the knowledge expert and information source for staff. Keep abreast of insurance, referral, and billing requirements",
    "Provides Ancillary Providers with necessary and accurate information related to insurance determination and financial compliance.",
    "Assist with application implementation, upgrades, enhancements, and usability testing. .",
    "Provides education and training to clinic leadership and partners to ensure financial policies are being adhered to.",
    "Reviews registration or authorization related denials and provides education as necessary to reduce write offs.",
    "Performs other duties as assigned."
  ],
  "realExperience": [
    {
      "employer": "Fox Lake Animal Hospital",
      "address": "110 S US Hwy 12, Fox Lake, IL 60020",
      "position": "Front Desk / Veterinary Assistant",
      "period": "January 2023 - February 2024",
      "hours": "40 hrs/wk",
      "duties": [
        "Managed patient flow (60-80/day)",
        "Triage patients",
        "Process new patient paperwork",
        "Charting",
        "Filing",
        "Answering phones",
        "Assisting in medical emergencies",
        "Handling payments and check-outs",
        "Supported sole pharmacist (orders, chart/med prep, approvals)"
      ],
      "supervisor": "Joanne Malanowski",
      "mayContact": true
    },
    {
      "employer": "The Center for Corrective Eye Surgery",
      "position": "Technician",
      "period": "2002",
      "duties": [
        "Scribe for Dr. Epstein",
        "Prepping patients for in-office procedures and surgeries",
        "Travel between two locations: McHenry and Des Plaines"
      ]
    },
    {
      "employer": "Midwest Sports Medicine",
      "position": "Supervisor of Front Desk, Call Center, and MRI Scheduling",
      "period": "1999-2002",
      "duties": [
        "Managed high-volume office operations",
        "Verified insurance",
        "Scheduled appointments",
        "Upsold in-house MRI services",
        "Flexible support at Orthopedic office"
      ],
      "employment_type": "Hourly position changed to salary",
      "supervisor": "Steve Mayworm, Office Administrator"
    },
    {
      "employer": "Family Medicine",
      "position": "Secretary for Family Physicians",
      "period": "1998-1999",
      "duties": [
        "Scheduling patient appointments",
        "Reconciling insurance issues",
        "Filing",
        "Confirming insurance plans",
        "Taking co-payments",
        "Processing referrals",
        "Calling in prescriptions",
        "Assisting with insurance correspondence",
        "Chart analysis and submissions"
      ],
      "supervisor": "Kim Case"
    },
    {
      "employer": "Northwest Oncology and Hematology",
      "position": "File Clerk and Secretary",
      "period": "1995-1998",
      "duties": [
        "Scheduling patient appointments",
        "Verifying insurance",
        "Processing referrals",
        "Customer service for chemotherapy patients",
        "Medical Records management",
        "Secretary for Dr. Grad and Dr. Bank",
        "Multi-location support"
      ],
      "supervisor": "Jan Schneider"
    }
  ]
}